app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.create(allowed_params)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "asf"], ["room_number", 0], ["created_at", "2019-06-29 01:39:44.174650"], ["updated_at", "2019-06-29 01:39:44.174650"]]

  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(allowed_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-07-01 19:40:54.278723"], ["id", 1]]